In [24]:
import pandas as pd

### https://adventofcode.com/2021/day/1

In [31]:
df1=pd.read_csv('day1_1.txt', header=None)
df1.columns=['val']
df1.tail()

       val
1995  9830
1996  9831
1997  9841
1998  9860
1999  9875

In [32]:
# Part 1
df1['calc1']=df1.val-df1.val.shift(1)
df1['result1']=df1.calc1.apply(lambda x:'increase' if x>0 else 'x')
df1.result1.value_counts()

increase    1722
x            278
Name: result1, dtype: int64

In [33]:
# Part 2
df1['three']=df1.val + df1.val.shift(-1) + df1.val.shift(-2)
df1['calc2']=df1.three-df1.three.shift(1)
df1['result2']=df1.calc2.apply(lambda x:'increase' if x>0 else 'x')
df1.result2.value_counts()

increase    1748
x            252
Name: result2, dtype: int64

### https://adventofcode.com/2021/day/2

In [34]:
df2=pd.read_csv('day2.txt', header=None)
df2.columns=['val']
df2.tail()

           val
995  forward 9
996     down 3
997     down 7
998     down 5
999  forward 7

In [39]:
df2['instr']=df2.val.apply(lambda x:x.split(' ')[0])
df2['num']=df2.val.apply(lambda x:float(x.split(' ')[1]))
dfD2P1=pd.DataFrame(df2.groupby('instr').num.sum().reset_index(name='tot'))
dfD2P1

     instr     tot
0     down  2046.0
1  forward  1990.0
2       up  1046.0

In [50]:
# part 2

aim=0
h=0
d=0
for idx, row in df2.iterrows():
    if row.instr == 'up':
        aim-=row.num 
    if row.instr == 'down':
        aim+=row.num
    if row.instr == 'forward':
        h+=row.num
        d+=aim * row.num

print(h, d, h*d)

1990.0 992674.0 1975421260.0